Werllley007/Projeto_FreeRTOS_LOG_EEPROM_RFID_OLED_2BTC_1LED/stm32f411ceu6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPI1_nCS_Pin GPIO_PIN_4
#define SPI1_nCS_GPIO_Port GPIOA
#define I2C2_SCL_OLED_Pin GPIO_PIN_10
#define I2C2_SCL_OLED_GPIO_Port GPIOB
#define I2C3_SCL_EEPROM_Pin GPIO_PIN_8
#define I2C3_SCL_EEPROM_GPIO_Port GPIOA
#define BTN_SEL_Pin GPIO_PIN_10
#define BTN_SEL_GPIO_Port GPIOA
#define BTN_SEL_EXTI_IRQn EXTI15_10_IRQn
#define BTN_ENTER_Pin GPIO_PIN_11
#define BTN_ENTER_GPIO_Port GPIOA
#define BTN_ENTER_EXTI_IRQn EXTI15_10_IRQn
#define I2C2_SDA_OLED_Pin GPIO_PIN_3
#define I2C2_SDA_OLED_GPIO_Port GPIOB
#define I2C3_SDA_EEPROM_Pin GPIO_PIN_4
#define I2C3_SDA_EEPROM_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_5
#define LED1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
